[
  {
    "QuestionID": "777e7a14-fea3-4c37-a0e6-9ffb50024d5c",
    "RetrievedPassages": [
      "Relevant Persons should comply with guidance issued by the EOCN regarding reporting suspicious activity and Transactions relating to money laundering, terrorist financing and proliferation financing.",
      "Relevant Persons should comply with guidance issued by the EOCN with regard to identifying and reporting suspicious activity and Transactions relating to money laundering, terrorist financing and proliferation financing.",
      "The MLRO must, following receipt of an internal notification of suspicious activity under Rule ‎14.2.2, document:\n(a)\tthe steps taken to investigate the circumstances in relation to which the internal notification is made; and\n(b)\twhere no external SAR/STR is made, the reasons why no such report was made.",
      "Chapter ‎14 contains the obligations applying to all Relevant Persons concerning Suspicious Activity/Transaction Reports, which are required to be made under Federal AML Legislation.",
      "Effective CDD measures may provide the basis for recognising unusual and suspicious activity and Transactions. Refusal to provide documentation to support CDD or refusal to disclose a beneficial owner may be considered suspicious activity. Where there is a customer relationship, suspicious activity will often be one that is inconsistent with a customer's known legitimate activity, or with the normal business activities for that type of account or customer. Therefore, the key to recognising \"suspicious activity\" is knowing enough about the customer and the customer's normal expected activities to recognise when their activity is abnormal."
    ],
    "Answer": "Yes, the ADGM can provide clarity on the level of detail and documentation that should accompany a report of suspicious activity to ensure it meets regulatory standards. Relevant Persons should comply with guidance issued by the EOCN regarding reporting suspicious activity and transactions relating to money laundering, terrorist financing, and proliferation financing. Chapter 14 contains the obligations applying to all Relevant Persons concerning Suspicious Activity/Transaction Reports, which are required to be made under Federal AML Legislation. The MLRO must document the steps taken to investigate the circumstances in relation to which the internal notification is made and the reasons why no external SAR/STR is made. Effective CDD measures may provide the basis for recognizing unusual and suspicious activity and transactions, and the key to recognizing \"suspicious activity\" is knowing enough about the customer and the customer's normal expected activities to recognize when their activity is abnormal."
  }
]